wiki/centos/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>关于CentOS的一些使用技巧</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="关于CentOS的一些使用技巧"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-09-26 Wed"/>
<meta name="author" content="Kelvin Hu"/>
<meta name="description" content="small skills/tips during using centos"/>
<meta name="keywords" content="linux, centos"/>
<link href="/media/css/main.css" rel="stylesheet" type="text/css" />


</head>
<body>

<div id="preamble">
<hgroup id="header">
  <h1><a href="/">Kelvin的胡言乱语</a></h1>
  <h2>重剑无锋，大巧不工。</h2>
</hgroup>
<nav id="main-nav">
  <ul id="nav-list-main">
    <li><a href="/blog/" class="menu">Blog</a></li>
    <li><a href="/wiki/" class="menu">Wiki</a></li>
    <li><a href="/tags/" class="menu">Tags</a></li>
    <li><a href="/about/" class="menu">About</a></li>
  </ul>
</nav>
<nav id="sub-nav" class="align-right">
  <div class="social">
    <a class="github" title="GitHub" href="https://github.com/kelvinh">GitHub</a>
    <!-- TODO: change the link below to proper value  -->
    <a class="rss" title="RSS(TODO)" href="TODO">RSS</a>
  </div>
  <form class="search" target="_blank" method="get" action="http://google.com/search">
    <input type="hidden" value="site:kelvinh.github.com" name="q" />
    <input type="text" class="align-right" results="0" name="q" />
  </form>
</nav>

</div>

<div id="content">
<h1 class="title">关于CentOS的一些使用技巧</h1>

<p>这是一篇备忘性质的文章，主要记录我在配置和管理CentOS服务器的过程中，遇到的一些问题及相应的解决办法，以及一些比较有用的命令或者tips。会不定期更新。
</p>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">yum related</h2>
<div class="outline-text-2" id="text-1">



</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">error 404:</h3>
<div class="outline-text-3" id="text-1-1">


<p>
   有时， <code>yum makecache</code> 或者其它命令可能会出现以下错误：
</p>
<pre class="example">
[Errno 14] HTTP Error 404: Not Found
</pre>


<p>
   这时，运行 <code>yum clean all</code> ，再执行相应命令即可。
</p>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2">Public key not installed:</h3>
<div class="outline-text-3" id="text-1-2">


<p>
   在安装软件包 <code>yum install xxx</code> 时出现 "Public key for * is not installed"：
</p>
<pre class="example">
# 注意把以下命令末尾的版本改成对应的版本
$ rpm --import /etc/pki/rpm-gpg/RPM-GPG-KEY-CentOS-6
</pre>


</div>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">ftp related</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1"><code>tar</code> error with ftp downloaded file:</h3>
<div class="outline-text-3" id="text-2-1">


<p>
   在解压用ftp下载的包时，出现以下错误：
</p>
<pre class="example">
Tar: Exiting with failure status due to previous errors
</pre>


<p>
   原因：通过ftp download下来的包在传输时没有使用二进制传送，所以tar解压失败。
</p>
<p>
   解决方案：在ftp登录之后，运行 <code>ftp&gt; bin</code> ，再进行 <code>get</code> 下载操作。
</p>
</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">network related</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">no network in a virtual machine:</h3>
<div class="outline-text-3" id="text-3-1">


<p>
   虚拟机中，以minimal模式新安装的CentOS连不上Internet，因为默认eth0没有打开，编辑以下文件：
</p>
<pre class="example">
/etc/sysconfig/network-scripts/ifcfg-eth0
</pre>


<p>
   将 ONBOOT="no" 的no改成yes即可。
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">shutdown firewall:</h3>
<div class="outline-text-3" id="text-3-2">


<p>
   CentOS的防火墙默认打开，并且应用了很强的规则，这时候其它机器无法访问其apache等web服务，应用以下命令关闭防火墙（这并非最好的解决方式，最好的解决方式是配置防火墙规则，放行某些端口）：
</p>
<pre class="example">
service iptables save
service iptables stop
chkconfig iptables off
</pre>


</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3">device "eth0" does not seem to be present:</h3>
<div class="outline-text-3" id="text-3-3">


<p>
   将一个虚拟机revert回某一个snapshot的时候，会报 <code>device "eth0" does not seem to be present</code> 的错误，打开 <code>/etc/sysconfig/network-scripts/ifcfg-eth0</code> ，会发现里面的MAC地址和Vmware虚拟机的settings里面的MAC address对不上。目测这应该是发生这个错误的原因所在。
</p>
<p>
   解决方法：实际证明，不管是修改虚拟机里面的MAC，或者修改Vmware的settings里面的MAC来让两者一致，都是没用的。最有效的方法：从settings里面删除当前的Network Adapter，再重新新建一个即可，Vmware会自动检测到硬件变化并对虚拟机做相应的设置。
</p></div>
</div>
</div>
</div>

<div id="postamble">
<div id="post-meta">
  <span title="post date" class="post-info">2012-09-26</span>
  <span title="last modification date" class="update-info">2013-04-01</span>
  <span title="tags" class="tags"><a href="/tags/linux/">Linux</a>, <a href="/tags/centos/">CentOS</a></span>
  <span title="author" class="author">Kelvin Hu</span>
</div>
<div id="footer">
  <p class="creator">Generated by Org version 7.9.4 with Emacs version 24</p>
  <p class="copyright">
    Copyright &copy; 2012 - 2013 <a href="mailto:ini &lt;dot&gt; kelvin &lt;at&gt; gmail &lt;dot&gt; com">Kelvin Hu</a>
    &nbsp;&nbsp;-&nbsp;&nbsp;
    Powered by <a href="https://github.com/kelvinh/org-page" target="_blank">org-page</a>
  </p>
</div>

</div>
</body>
</html>
